
// #1

// for(x=1; x<=10; x++){
//     alert(`y=${x}^2 \ny = ${x**2};`);
// }


// #2

// let n = +prompt("Введите значение n");
// let s = 0;

// for(x=1; x<=n; x++){
//     s+=x;
// }
// alert(s)


// #3

// let s = 10000;
// let a = 1;
// for(; a<=5; a++){
//     s=0.1*s;
//     console.log(`${a} год - ${s} баксов`)
// }








// Таблица умножения

// for(i=2; i<=10; i++){
//     console.log(`-------------${i}-------------`)
//     for(j=1; j<11; j++){
//         console.log(`${i} * ${j} = ${i*j}`)
//     }
    
// }
